src/DataProcessors/ПриёмоСдаточныеИспытания/ПриёмоСдаточныеИспытания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПриёмоСдаточныеИспытания</name>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ПЗ</name>
      <type>
        <types>DocumentRef.ПроизводственноеЗадание</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУпаковки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/InformationRegisters/ЭтапыПроизводственныхЗаданий/ЭтапыПроизводственныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭтапыПроизводственныхЗаданий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </resources>
  <resources>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидыМПЗ/ВидыМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМПЗ</name>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикаты</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ПроизводственноеЗадание/ПроизводственноеЗадание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроизводственноеЗадание</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОчереди</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГрупповойУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияSMD</name>
    <type>
      <types>CatalogRef.ЛинииSMD</types>
    </type>
  </attributes>
  <attributes>
    <name>Остановлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Перемещено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Испытания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СторонняяПоверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаРасходов</name>
      <type>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогНормыРасходов</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Канбаны</name>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>МТК</name>
      <type>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Прессформы</name>
    <attributes>
      <name>Станок</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Прессформа</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ДвижениеМПЗ/ДвижениеМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвижениеМПЗ</name>
  <basedOn>Document.ДвижениеМПЗ</basedOn>
  <basedOn>Document.ЗаявкаОтПокупателя</basedOn>
  <basedOn>Document.ПоступлениеМПЗ</basedOn>
  <basedOn>Document.ПоступлениеМПЗПрочее</basedOn>
  <basedOn>Document.ВыпускПродукцииКанбан</basedOn>
  <basedOn>Document.МаршрутнаяКарта</basedOn>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.ПоступлениеИзПереработки</basedOn>
  <basedOn>Document.Перепрогон</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <registerRecords>AccumulationRegister.Долги</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.Перепрогон</types>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ПоступлениеМПЗПрочее</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
      <types>DocumentRef.ПоступлениеМПЗ</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияВ</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.КомментарииНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСборке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/ПриёмоСдаточныеИспытания/Forms/Форма/Module.bsl
&НаСервере
Процедура ВыбратьПродукциюНаСервере()
Объект.ТабличнаяЧасть.Очистить();
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.Ссылка,
	|	ПроизводственноеЗадание.ДатаГрупповойУпаковки
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.Линейка = &Линейка
	|	И ПроизводственноеЗадание.ВозвратнаяТара = &ВозвратнаяТара
	|	И ПроизводственноеЗадание.ДатаГрупповойУпаковки МЕЖДУ &ДатаНач И &ДатаКон";
Запрос.УстановитьПараметр("Линейка", Объект.Линейка);
Запрос.УстановитьПараметр("ВозвратнаяТара", Строка(Объект.Тара));
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Объект.ДатаВыпуска));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(Объект.ДатаВыпуска));
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	ТЧ = Объект.ТабличнаяЧасть.Добавить();
	ТЧ.ПЗ = Выборка.Ссылка;
	ТЧ.ДатаУпаковки = Выборка.ДатаГрупповойУпаковки;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПродукцию(Команда)
ВыбратьПродукциюНаСервере();
КонецПроцедуры

&НаСервере
Функция ОтправитьНаПСИНаСервере()
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	Подразделение = Объект.ТабличнаяЧасть[0].ПЗ.Подразделение;
	Перемещение = Документы.ДвижениеМПЗ.СоздатьДокумент();
	Перемещение.Дата = ТекущаяДата();
	Перемещение.УстановитьНовыйНомер(ПрисвоитьПрефикс(Подразделение));
	Перемещение.Автор = ПараметрыСеанса.Пользователь;
	Перемещение.Подразделение = Подразделение;
	Перемещение.МестоХранения = Объект.Линейка.МестоХраненияГП;
	Перемещение.МестоХраненияВ = Справочники.МестаХранения.НайтиПоКоду("09");
		Для каждого Стр Из Объект.ТабличнаяЧасть Цикл
			Если Стр.Пометка Тогда
			ПЗ = Стр.ПЗ.ПолучитьОбъект();
			ПЗ.ВозвратнаяТара = "";
			ПЗ.Записать(РежимЗаписиДокумента.Запись);
			ТЧ = Перемещение.ТабличнаяЧасть.Добавить();
			ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
			ТЧ.МПЗ = Стр.ПЗ.Изделие;
			ТЧ.Количество = 1;
			ТЧ.ЕдиницаИзмерения =  Стр.ПЗ.Изделие.ОсновнаяЕдиницаИзмерения;			
			КонецЕсли; 			
		КонецЦикла;
			Если Перемещение.ТабличнаяЧасть.Количество() > 0 Тогда
			Перемещение.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
			Сообщить("Ничего не выбрано для перемещения!");
		    ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
			Возврат Документы.ДвижениеМПЗ.ПустаяСсылка();
			КонецЕсли;  
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Возврат Документы.ДвижениеМПЗ.ПустаяСсылка();
	КонецПопытки;	
Возврат Перемещение.Ссылка;
КонецФункции

&НаКлиенте
Процедура ОтправитьНаПСИ(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда	
	Ссылка = ОтправитьНаПСИНаСервере();
		Если Не Ссылка.Пустая() Тогда
		ПоказатьОповещениеПользователя("Создание:",,"Создано перемещение на ПСИ!",БиблиотекаКартинок.Пользователь);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПечатьГрупповойУпаковкиНаСервере(ТД)
ТаблицаВыпуска = Новый ТаблицаЗначений;

ТаблицаВыпуска.Колонки.Добавить("Продукция",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
ТаблицаВыпуска.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(9,3)));

Макет = ПолучитьОбщийМакет("ОтчетПоУпаковочнойТаре"); 
ОблШапка = Макет.ПолучитьОбласть("Шапка");	
ОблПЗ = Макет.ПолучитьОбласть("ПЗ");
ОблИтого = Макет.ПолучитьОбласть("Итого");
ОблИзделие = Макет.ПолучитьОбласть("Изделие");
ОблКонец = Макет.ПолучитьОбласть("Конец");
ОблШапка.Параметры.ВыбЛинейка = Объект.Линейка.Наименование;
ОблШапка.Параметры.Тара = Объект.Тара;
ОблШапка.Параметры.ДатаОтчёта = Формат(Объект.ДатаВыпуска,"ДФ=dd.MM.yyyy");
ТД.Вывести(ОблШапка);
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	barcode = ПолучитьCOMОбъект("","STROKESCRIBE.StrokeScribeClass.1");
	barcode.Alphabet=25; //QRCODE
	QRCode = "";
	НомСтр = 0;              
	КолВсего = 0;
		Для каждого Стр Из Объект.ТабличнаяЧасть Цикл
			Если Не Стр.Пометка Тогда
			НомСтр = НомСтр + 1;
			ТЧ_ТВ = ТаблицаВыпуска.Добавить();
			ТЧ_ТВ.Продукция = Стр.ПЗ.Изделие;
			ТЧ_ТВ.Количество = 1;
			ОблПЗ.Параметры.НомСтр = НомСтр;
			ОблПЗ.Параметры.Наимен = Стр.ПЗ.Изделие; 
			ОблПЗ.Параметры.НомерПЗ = Стр.ПЗ.Номер;
			ОблПЗ.Параметры.ПЗ = Стр.ПЗ;
			ОблПЗ.Параметры.Счёт = Стр.ПЗ.ДокументОснование.Счёт;
			ОблПЗ.Параметры.БарКод = Стр.ПЗ.БарКод;
			КодDanfoss = ОбщийМодульВызовСервера.ПолучитьКодDanfoss(Стр.ПЗ.БарКод);
				Если ЗначениеЗаполнено(КодDanfoss) Тогда
				ОблПЗ.Параметры.ЗавНомер = Стр.ПЗ.БарКод + "\" + КодDanfoss;
				Иначе
				ОблПЗ.Параметры.ЗавНомер = Стр.ПЗ.БарКод;
				КонецЕсли;
			ТД.Вывести(ОблПЗ);
			КолВсего = КолВсего + 1; 
			QRCode = QRCode+глНаименованиеВСкобкахБезЭтапа(Стр.ПЗ.Изделие.Наименование)+";"+Стр.ПЗ.БарКод+";"+СокрЛП(Стр.ПЗ.ДокументОснование.Счёт)+";";		
			КонецЕсли; 			
		КонецЦикла;
	ОблИтого.Параметры.КолВсего = КолВсего;
	ТД.Вывести(ОблИтого);	
	ТаблицаВыпуска.Свернуть("Продукция","Количество"); 
	ТаблицаВыпуска.Сортировать("Продукция");
		Для каждого ТЧ из ТаблицаВыпуска Цикл
		ОблИзделие.Параметры.Наимен = ТЧ.Продукция;                  
		ОблИзделие.Параметры.Кол = ТЧ.Количество; 
		ТД.Вывести(ОблИзделие);		        	
		КонецЦикла;
	ИмяФайла=ПолучитьИмяВременногоФайла("wmf");
	barcode.Text=QRCode;
	barcode.UTF8=1;
	barcode.QrECL=2;
	код=barcode.SavePicture(ИмяФайла,7,100,100);          
		Если код <> 0 Тогда //Проверка результата генерации штрихкода
		Сообщить(строка(код) + " - " + barcode.ErrorDescription);
		ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
		Возврат Ложь;
		КонецЕсли;
	рис=ОблКонец.Рисунки.QRCode;
	рис.РазмерКартинки=РазмерКартинки.Пропорционально;
	рис.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	рис.Картинка = Новый Картинка(ИмяФайла);
	ОблКонец.Параметры.Исполнитель = ПараметрыСеанса.Пользователь;	
	ТД.Вывести(ОблКонец);
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Возврат Истина;
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Возврат Ложь;
	КонецПопытки;
КонецФункции

&НаКлиенте
Процедура ПечатьГрупповойУпаковки(Команда)
ТД = Новый ТабличныйДокумент;

	Если ПечатьГрупповойУпаковкиНаСервере(ТД) Тогда 
	ТД.РазмерСтраницы = "A4";
	ТД.ПолеСлева = 0;
	ТД.ПолеСверху = 0;
	ТД.ПолеСнизу = 0;
	ТД.ПолеСправа = 0;
	ТД.РазмерКолонтитулаСверху = 0;
	ТД.РазмерКолонтитулаСнизу = 0;
	ТД.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТД.Показать("Отчёт по упаковочной таре. Выпуск на "+Объект.ДатаВыпуска);		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВернутьНаСкладЛинейкиНаСервере()
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	Подразделение = Объект.ТабличнаяЧасть[0].ПЗ.Подразделение;
	Перемещение = Документы.ДвижениеМПЗ.СоздатьДокумент();
	Перемещение.Дата = ТекущаяДата();
	Перемещение.УстановитьНовыйНомер(ПрисвоитьПрефикс(Подразделение));
	Перемещение.Автор = ПараметрыСеанса.Пользователь;
	Перемещение.Подразделение = Подразделение;
	Перемещение.МестоХранения = Справочники.МестаХранения.НайтиПоКоду("09");
	Перемещение.МестоХраненияВ = Объект.Линейка.МестоХраненияГП;
		Для каждого Стр Из Объект.ТабличнаяЧасть Цикл
		ТЧ = Перемещение.ТабличнаяЧасть.Добавить();
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
		ТЧ.МПЗ = Стр.ПЗ.Изделие;
		ТЧ.Количество = 1;
		ТЧ.ЕдиницаИзмерения =  Стр.ПЗ.Изделие.ОсновнаяЕдиницаИзмерения;					
		КонецЦикла;
			Если Перемещение.ТабличнаяЧасть.Количество() > 0 Тогда
			Перемещение.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
			Сообщить("Ничего не выбрано для перемещения!");
		    ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
			Возврат Документы.ДвижениеМПЗ.ПустаяСсылка();			
			КонецЕсли;  
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Возврат Документы.ДвижениеМПЗ.ПустаяСсылка();
	КонецПопытки;
Возврат Перемещение.Ссылка;
КонецФункции

&НаКлиенте
Процедура ВернутьНаСкладЛинейки(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда	
	Ссылка = ВернутьНаСкладЛинейкиНаСервере();
		Если Не Ссылка.Пустая() Тогда
		ПоказатьОповещениеПользователя("Создание:",,"Создано перемещение на склад линейки!",БиблиотекаКартинок.Пользователь);
		КонецЕсли;	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере()
Объект.ТабличнаяЧасть.Очистить();
Объект.Тара = 0;
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоБарКодуНаСервере(БарКод)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ДатаОкончания
	|ИЗ
	|	РегистрСведений.ЭтапыПроизводственныхЗаданий.СрезПоследних КАК ЭтапыПроизводственныхЗаданийСрезПоследних
	|ГДЕ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.БарКод = &БарКод";	
Запрос.УстановитьПараметр("БарКод",БарКод);
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	ТЧ = Объект.ТабличнаяЧасть.Добавить();
	ТЧ.ПЗ = Выборка.ПЗ;
	ТЧ.ДатаУпаковки = Выборка.ПЗ.ДатаГрупповойУпаковки;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоБарКоду(Команда)
БарКод = "";
	Если ВвестиСтроку(БарКод,"Введите бар-код",18) Тогда
	ДобавитьПоБарКодуНаСервере(БарКод);
	КонецЕсли;                   
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ВидОбработки = 1;
Объект.ДатаВыпуска = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ВидОбработкиПриИзменении(Элемент)
ОчиститьНаСервере();
	Если ВидОбработки = 1 Тогда
	Элементы.ОтправкаНаПСИ.Видимость = Истина;
	Элементы.Тара.Видимость = Истина;
	Элементы.Выбрать.Видимость = Истина;
	Элементы.ТабличнаяЧастьПометка.Видимость = Истина;
	Элементы.ВозвратНаЛинейку.Видимость = Ложь;
	Иначе
	Элементы.ОтправкаНаПСИ.Видимость = Ложь;
	Элементы.Тара.Видимость = Ложь;
	Элементы.Выбрать.Видимость = Ложь;
	Элементы.ТабличнаяЧастьПометка.Видимость = Ложь;
	Элементы.ВозвратНаЛинейку.Видимость = Истина;	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если ЭтаФорма.ВводДоступен() Тогда
	ДобавитьПоБарКодуНаСервере(Данные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ОписаниеОшибки = "";
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
   Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
      ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
      ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , ОписаниеОшибки);
      Сообщить(ТекстСообщения);
   КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
КонецПроцедуры
